# Notebook used to answer the test on the recruitment platform

In [2]:
import pandas as pd
import numpy as np
df = pd.read_csv('air_system_previous_years.csv')
df.head()

,class,aa_000,ab_000,ac_000,ad_000,ae_000,af_000,ag_000,ag_001,ag_002,...,ee_002,ee_003,ee_004,ee_005,ee_006,ee_007,ee_008,ee_009,ef_000,eg_000
0,neg,76698,na,2130706438,280,0,0,0,0,0,...,1240520,493384,721044,469792,339156,157956,73224,0,0,0
1,neg,33058,na,0,na,0,0,0,0,0,...,421400,178064,293306,245416,133654,81140,97576,1500,0,0
2,neg,41040,na,228,100,0,0,0,0,0,...,277378,159812,423992,409564,320746,158022,95128,514,0,0
3,neg,12,0,70,66,0,10,0,0,0,...,240,46,58,44,10,0,0,0,4,32
4,neg,60874,na,1368,458,0,0,0,0,0,...,622012,229790,405298,347188,286954,311560,433954,1218,0,0

In [3]:
pos_percentage = (df['class'] == 'pos').mean() * 100
pos_percentage

np.float64(1.6666666666666667)

In [4]:
df['ee_003'].replace('na', np.nan).astype(float).describe()

count    5.932900e+04
mean     2.111264e+05
std      5.433188e+05
min      0.000000e+00
25%      1.166000e+03
50%      1.120860e+05
75%      2.182320e+05
max      3.775839e+07
Name: ee_003, dtype: float64

In [5]:
ag_002 = df['ag_002'].replace('na', np.nan)
ag_002 = ag_002.dropna().astype(float)
ag_002.describe()

count    5.932900e+04
mean     8.606015e+03
std      1.503220e+05
min      0.000000e+00
25%      0.000000e+00
50%      0.000000e+00
75%      0.000000e+00
max      1.055286e+07
Name: ag_002, dtype: float64

In [6]:
df_cleaned = df.replace('na', np.nan).dropna()
df_cleaned['ag_002'].replace('na', np.nan).astype(float).describe()

count    5.910000e+02
mean     6.560618e+04
std      3.621030e+05
min      0.000000e+00
25%      0.000000e+00
50%      0.000000e+00
75%      2.124000e+03
max      6.328192e+06
Name: ag_002, dtype: float64

In [7]:
correlation_ag002_ee007 = df_cleaned[['ag_002', 'ee_007']].corr('spearman')
correlation_ag002_ee007

          ag_002    ee_007
ag_002  1.000000  0.310634
ee_007  0.310634  1.000000

In [8]:
correlation_ee005_ac000 = df_cleaned[['ee_005', 'ac_000']].corr('pearson')
correlation_ee005_ac000

         ee_005   ac_000
ee_005  1.00000 -0.08472
ac_000 -0.08472  1.00000

In [9]:
df_cleaned['ad_000'] = df_cleaned['ad_000'].astype(float)
median_by_class = df_cleaned.groupby('class')['ad_000'].median()
median_by_class

class
neg    512.0
pos    732.0
Name: ad_000, dtype: float64

In [10]:
df_cleaned['ee_001'] = df_cleaned['ee_001'].astype(float)
value = df_cleaned.groupby('class')['ee_001']
value.mean()

class
neg    1.743964e+06
pos    2.625715e+06
Name: ee_001, dtype: float64

In [11]:
df = pd.read_csv('air_system_previous_years.csv')
df.replace('na', np.nan, inplace=True)
na_counts = df.isna().sum().sum()
print(na_counts)

850015

In [12]:
df.isna().sum().sort_values(ascending=False)

br_000    49264
bq_000    48722
bp_000    47740
bo_000    46333
ab_000    46329
          ...
cj_000      338
ci_000      338
bt_000      167
aa_000        0
class         0
Length: 171, dtype: int64

In [13]:
df_cleaned['ci_000'].astype(float).quantile(0.32)

np.float64(8838965.76)